#include "UI.h"
#include <stdio.h>

void print_actions()
{
    printf("\033[0;33mВыберите действие:\n");
    printf("1) Добавить строку в дерево\n");
    printf("2) Добавить узел\n");
    printf("3) Удалить узел\n");
    printf("4) Вывести в строку\n");
    printf("5) Вывести в виде дерева\n");
    printf("6) Вывести узел\n");
    printf("7) Удалить повторяющиеся буквы и сбалансировать\n");
    printf("8) Ввести хэш-таблицу\n");
    printf("9) Вывести хэш-таблицу\n");
    printf("99) Вывести всю хэш-таблицу\n");
    printf("10) Найти символ в таблице\n");
    printf("11) Сравнить структуры\n");
    printf("-1) Очистить дерево\n");
    printf("0) Выход\033[0;37m\n");
}